export const DEFAULT_PARAMS_FSRS6 = [
  0.2172, // w0
  1.1771, // w1
  3.2602, // w2
  16.1507, // w3
  7.0114, // w4 - 用于计算初始难度 D₀(G)
  0.57, // w5 - 衰减参数，用于计算 D₀(G)
  2.0966, // w6 - 用于计算线性阻尼 ΔD(G)= -w6*(G-3)
  0.0069, // w7 - 均值回归系数，控制更新后的难度回归目标
  1.5261, // w8 - 新回忆后稳定性中系数，参与 exp() 部分计
  0.112, // w9 - 用于难度更新中 10^(–w9) 的指数部分，也参与新稳定性计算
  1.0178, // w10 - 用于新稳定性计算中 exp(w10*(1-R))
  1.849, // w11 - 用于遗忘后稳定性 S_f′ 中 D 部分的系数
  0.1133, // w12 - 用于遗忘后稳定性 S_f′ 中乘积项的系数
  0.3127, // w13 - 用于遗忘后稳定性中 (S+1) 的幂次
  2.2934, // w14 - 用于遗忘后稳定性中 exp( w14*(1-R) ) 的系数
  0.2191, // w15 - 新回忆后稳定性中，评分 Hard (G=2) 时的 bonus
  3.0004, // w16 - 新回忆后稳定性中，评分 Easy (G=4) 时的 bonus
  0.7536, // w17 - 用于同日复习稳定性更新中 S′ = S * exp( w17*(G-3+w18) )
  0.3332, // w18 - 同日复习稳定性更新中的常数偏移量
  0.1437, // w19 - 同日复习稳定性更新中的 S 指数调节参数
  0.2, // w20 - 遗忘曲线衰减因子
];

export const MIN_DIFFICULTY = 1;
export const MAX_DIFFICULTY = 10;

export const MIN_STABILITY = 0.01;
export const MAX_STABILITY = 36500.0;

export const DEFAULT_DESIRED_RETENTION = 0.9;
